kittiphun-rut/IV-Monitor-BCNPH/firmware/ESP32-S3-FlowSim-Lab/ESP32-S3-FlowSim-Lab.ino
/**
 * ============================================================================
 * โครงการวิจัย: นวัตกรรม Smart IV Alert
 * หน่วยงาน: หอผู้ป่วยอายุรกรรม โรงพยาบาลสูงเม่น จังหวัดแพร่
 * สถาบัน: วิทยาลัยพยาบาลบรมราชชนนี แพร่ คณะพยาบาลศาสตร์ สถาบันพระบรมราชชนก
 *
 * ระบบ: FLOW SIMULATION & SENSOR LAB (เครื่องมือทดลอง/สาธิตเฉพาะเครื่องเดียว)
 * เวอร์ชัน: S1.0.0  (ดัดแปลงจาก Bed Station v7.3.0)
 * บอร์ด: ESP32-S3 Super Mini + TFT 1.47" (ST7789 SPI 172x320) + Passive Buzzer
 * Arduino-ESP32 Core: 3.x
 *
 * จุดประสงค์ของเวอร์ชันนี้
 *  - ใช้เป็น "แบบจำลองกราฟแสดงสถานะการไหล" บนหน้าจอ TFT สำหรับพัฒนา/สาธิต/สอนงาน
 *  - ตัดการเชื่อมต่อทุกชนิดออก: ไม่มี Wi-Fi, ไม่มี ESP-NOW, ไม่มี Host, ไม่มีนาฬิกา NTP
 *  - เหลือเฉพาะ 2 งานหลักคือ (1) การตรวจจับหยด และ (2) การคาลิเบรตเซนเซอร์
 *  - เพิ่มกราฟรูปคลื่น (waveform) และกราฟแท่ง (bar graph) เพื่อดูแนวโน้มการไหล
 *    และดู "ความไว (sensitivity)" ของเซนเซอร์แบบเห็นภาพจริง
 *  - มีโหมดจำลอง (SIM) สร้างสัญญาณหยดสังเคราะห์ ใช้สาธิตหน้าจอได้แม้ไม่ต่อเซนเซอร์
 *
 * 3 หน้าจอหลัก (คลิก 1 ครั้งเพื่อเปลี่ยนหน้า)
 *  [1] WAVE   — รูปคลื่นค่า ADC สด + เส้นเกณฑ์ตัดสิน + แถบพัลส์การนับหยด
 *  [2] TREND  — กราฟแท่งแนวโน้มอัตราไหล (gtt/min) ย้อนหลัง 60 วินาที
 *  [3] SENSOR — ค่าคาลิเบรต, เกจตำแหน่งสัญญาณ, สัญญาณรบกวน และคะแนนความไว
 *
 * ปุ่มกดเดียว (BTN_PIN) ทำได้ทุกคำสั่ง
 *  1 คลิก  = เปลี่ยนหน้า            2 คลิก  = RUN / HOLD (หยุดพักการนับ)
 *  3 คลิก  = ล้างสถิติทั้งหมด        4 คลิก  = เปิด/ปิดโหมดจำลองและเลือกอัตรา
 *  กด 3 วิ = เข้า Calibration Wizard  กด 5 วิ = หน้าวิธีใช้/ผู้พัฒนา
 * ============================================================================
 */

#include <Adafruit_GFX.h>
#include <Adafruit_ST7789.h>
#include <SPI.h>
#include <Preferences.h>
#include <math.h>

#define APP_VERSION   "S1.0.0"

// ----------------------------------------------------------------------------
// ขาต่อใช้งาน (เหมือนเครื่องจริงทุกประการ เพื่อให้ย้ายโค้ดกลับไปใช้ได้ทันที)
// ----------------------------------------------------------------------------
#define TFT_CS        9
#define TFT_DC        10
#define TFT_RST       11
#define TFT_MOSI      12
#define TFT_SCLK      13
#define TFT_BLK       8

#define SENSOR_AO_PIN 4
#define BUZZER_PIN    3
#define BTN_PIN       2
#define RGB_LED_PIN   48

// ----------------------------------------------------------------------------
// ค่าคงที่ของการวัด
// ----------------------------------------------------------------------------
#define DROP_FACTOR        20        // gtt/mL ของชุดให้สารน้ำที่ใช้ทดลอง (10/15/20/60)
#define MIN_DROP_INTERVAL  55UL      // กันนับซ้ำ (ms) — เท่ากับเครื่องจริง
#define SOUND_ON_DROP      true      // เสียงติ๊กสั้นทุกหยด ช่วยฟังจังหวะขณะปรับเซนเซอร์

#define THEME_BG      0x0000
#define THEME_SKYBLUE 0x5DFF
#define THEME_CYAN    0x07FF
#define THEME_PINK    0xFD79
#define THEME_NAVY    0x09CD
#define THEME_DARKBOX 0x18C5
#define THEME_MAROON  0x6000

#define COLOR_WHITE   0xFFFF
#define COLOR_GREEN   0x07E0
#define COLOR_RED     0xF800
#define COLOR_ORANGE  0xFD20
#define COLOR_YELLOW  0xFFE0

#ifndef ST77XX_LIGHTGREY
  #define ST77XX_LIGHTGREY 0xC618
#endif
#ifndef ST77XX_DARKGREY
  #define ST77XX_DARKGREY  0x39E7
#endif

#if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
  #define LED_WRITE(pin, r, g, b) rgbLedWrite(pin, r, g, b)
#else
  #define LED_WRITE(pin, r, g, b) neopixelWrite(pin, r, g, b)
#endif

SPIClass SPI_TFT(FSPI);
Adafruit_ST7789 tft = Adafruit_ST7789(&SPI_TFT, TFT_CS, TFT_DC, TFT_RST);
Preferences labPrefs;

// ----------------------------------------------------------------------------
// ผังหน้าจอ (จอแนวตั้ง 172 x 320)
// ----------------------------------------------------------------------------
#define SCR_W          172
#define SCR_H          320
#define TOPBAR_H       22
#define FOOTER_Y       302

// หน้า 1: กราฟรูปคลื่น
#define WAVE_COLS      152                 // 1 คอลัมน์ = 1 พิกเซล = 1 ช่วงเวลา
#define WAVE_BUCKET_MS 20UL                // 152 x 20ms = ~3 วินาทีต่อหน้าจอ
#define WAVE_X         12
#define WAVE_Y         92
#define WAVE_H         100
#define PULSE_X        12
#define PULSE_Y        216
#define PULSE_H        14

// หน้า 2: กราฟแท่งแนวโน้ม
#define TREND_BARS     30
#define TREND_BIN_MS   2000UL              // 30 แท่ง x 2 วินาที = ย้อนหลัง 60 วินาที
#define CHART_X        12
#define CHART_BAR_W    5                   // แท่งกว้าง 4 + เว้น 1
#define CHART_TOP      110
#define CHART_BOT      216

enum AppState { STATE_MAIN, STATE_ABOUT };
enum PageId   { PAGE_WAVE = 1, PAGE_TREND = 2, PAGE_SENSOR = 3 };

AppState currentState = STATE_MAIN;
int  currentPage      = PAGE_WAVE;
bool needRedraw       = true;

// ---- สถานะการนับหยด -------------------------------------------------------
bool     isRunning            = true;
bool     dropState            = false;
uint32_t totalDrops           = 0;
float    currentFlowRate_ml_hr = 0.0f;
float    currentGttMin        = 0.0f;
float    totalVolumeMl        = 0.0f;
bool     hasFirstDropOccurred = false;
bool     rateAnchorValid      = false;
unsigned long lastDropTimestamp = 0;
unsigned long lastDebounceTime  = 0;

// ---- ค่าคาลิเบรตเซนเซอร์ (ใช้ namespace เดียวกับเครื่องจริง st_cal) --------
int  valLiquid     = 1200;   // ADC ขณะมีสารน้ำ/หยดผ่านลำแสง
int  valAir        = 2800;   // ADC ขณะกระเปาะว่าง (ค่าฐาน)
int  dropThreshold = 2000;
int  hysteresis    = 200;
bool dropLowersAdc = true;   // true = หยดทำให้ค่า ADC ลดลง

// ---- ค่าที่อ่านได้สด ------------------------------------------------------
int rawAdc = 0;

// ---- สถิติสัญญาณรบกวน (ดูความไวของเซนเซอร์) -------------------------------
int  noiseP2P        = 0;    // สัญญาณรบกวนของเส้นฐาน (0 = ยังวัดไม่ได้)
int  noiseSubMin     = 4095; // หน้าต่างย่อย 50 ms
int  noiseSubMax     = 0;
int  noiseSubSamples = 0;
int  noiseBestP2P    = -1;   // ค่าน้อยสุดของหน้าต่างย่อยใน 1 วินาที
unsigned long noiseSubStart = 0;
unsigned long noiseWinStart = 0;

// ---- สถิติช่วงเวลาระหว่างหยด ----------------------------------------------
#define INTERVAL_KEEP 8
uint32_t dropIntervals[INTERVAL_KEEP];
int      intervalCount = 0;
int      intervalHead  = 0;
uint32_t lastIntervalMs = 0;

// ---- บัฟเฟอร์กราฟรูปคลื่น -------------------------------------------------
uint16_t waveMin[WAVE_COLS];
uint16_t waveMax[WAVE_COLS];
bool     waveHas[WAVE_COLS];
bool     waveDrop[WAVE_COLS];
int      waveIdx        = 0;
int      bucketMin      = 4095;
int      bucketMax      = 0;
bool     bucketDrop     = false;
int      bucketSamples  = 0;
unsigned long lastBucketMs = 0;
int      plotLow = 0, plotHigh = 4095;
int      threshY = 0, hysUpY = 0, hysDownY = 0;

// ---- บัฟเฟอร์กราฟแท่งแนวโน้ม ----------------------------------------------
float    trendBin[TREND_BARS];        // ค่าเฉลี่ย gtt/min ของแต่ละช่วง
bool     trendHas[TREND_BARS];
int      trendHead      = 0;          // ช่องที่เก่าที่สุด
float    binRateSum     = 0.0f;
int      binRateSamples = 0;
float    binLiveValue   = 0.0f;
unsigned long binStartMs   = 0;
unsigned long lastRateSample = 0;
bool     trendNeedsRedraw = true;
float    chartScale     = 10.0f;      // สเกลสูงสุดของแกนตั้งที่ใช้วาดครั้งล่าสุด

// ---- โหมดจำลอง (SIM) ------------------------------------------------------
const float SIM_RATES[] = { 0.0f, 30.0f, 60.0f, 120.0f, 180.0f };   // mL/h
#define SIM_RATE_COUNT   5
#define SIM_DROP_MS      45UL          // ความกว้างของพัลส์หยด 1 หยด
#define SIM_PAUSE_EVERY  20            // ทุก ๆ 20 หยด จำลอง "หยุดไหล" 1 ครั้ง
int      simRateIdx     = 0;           // 0 = ปิด
bool     simDropActive  = false;
unsigned long simDropStartMs = 0;
unsigned long simNextDropMs  = 0;
uint32_t simDropsDone   = 0;

