kittiphun-rut/IV-Monitor-BCNPH/firmware/ESP32-S3-FlowSim-Lab/ESP32-S3-FlowSim-Lab.ino
// ---- เสียง/ไฟ LED ---------------------------------------------------------
unsigned long buzzerBeepUntil = 0;
unsigned long ledFlashUntil   = 0;
int lastLedCode = -1;

// ---- UI ปุ่มค้าง ----------------------------------------------------------
bool isHoldUiActive  = false;
bool holdBeep3sDone  = false;
bool holdBeep5sDone  = false;
unsigned long lastHoldRenderTime = 0;

// ---- แคชข้อความ (วาดทับได้โดยไม่กะพริบ) -----------------------------------
String cacheTop1 = "", cacheTop2 = "", cacheTop3 = "";
int    cacheGtt = -999, cacheMlhr = -999;
String cacheP1a = "", cacheP1b = "", cacheP1c = "";
String cacheP2a = "", cacheP2b = "", cacheP2c = "", cacheP2kpi = "";
String cacheP3big = "", cacheP3a = "", cacheP3b = "", cacheP3c = "";
int    cacheGaugeAdc = -999;
unsigned long lastDynamicMs = 0;

// ============================================================================
// ฟังก์ชันช่วยวาดข้อความ / เสียง / ไฟ
// ============================================================================
String padCenter(const String &s, unsigned int width) {
  if (s.length() >= width) return s;
  unsigned int total = width - s.length();
  unsigned int left = total / 2;
  String out;
  out.reserve(width);
  for (unsigned int i = 0; i < left; i++) out += ' ';
  out += s;
  for (unsigned int i = 0; i < total - left; i++) out += ' ';
  return out;
}

String padRight(const String &s, unsigned int width) {
  String out = s;
  while (out.length() < width) out += ' ';
  return out;
}

void drawCenteredString(const String &str, int y, uint8_t size, uint16_t color, uint16_t bg) {
  int16_t x1, y1;
  uint16_t w, h;
  tft.setTextSize(size);
  tft.getTextBounds(str, 0, y, &x1, &y1, &w, &h);
  int x = (SCR_W - (int)w) / 2;
  if (x < 0) x = 0;
  tft.setTextColor(color, bg);
  tft.setCursor(x, y);
  tft.print(str);
}

void drawStringAt(const String &str, int x, int y, uint8_t size, uint16_t color, uint16_t bg) {
  tft.setTextSize(size);
  tft.setTextColor(color, bg);
  tft.setCursor(x, y);
  tft.print(str);
}

// เขียนข้อความชิดขวา โดยให้ตัวอักษรสุดท้ายจบที่ตำแหน่ง xRight
void drawStringRight(const String &str, int xRight, int y, uint8_t size, uint16_t color, uint16_t bg) {
  int w = str.length() * 6 * size;
  drawStringAt(str, xRight - w, y, size, color, bg);
}

void setLedColor(uint8_t r, uint8_t g, uint8_t b) {
  LED_WRITE(RGB_LED_PIN, r, g, b);
}

void beepNonBlocking(uint16_t freq, uint16_t durationMs) {
  tone(BUZZER_PIN, freq);
  buzzerBeepUntil = millis() + durationMs;
}

void modalSafeBeep(uint16_t freq, uint16_t durationMs) {
  tone(BUZZER_PIN, freq);
  delay(durationMs);
  noTone(BUZZER_PIN);
  buzzerBeepUntil = 0;
}

void soundClick() { beepNonBlocking(2600, 20); }
void soundStart() { beepNonBlocking(2000, 70); }
void soundStop()  { beepNonBlocking(1000, 140); }
void soundDrop()  { if (SOUND_ON_DROP) beepNonBlocking(3200, 12); }

void playWelcomeMelody() {
  int notes[] = { 1046, 1318, 1568, 2093 };
  for (int i = 0; i < 4; i++) {
    modalSafeBeep(notes[i], 80);
    delay(25);
  }
}

void handleBuzzerEngine(unsigned long now) {
  if (buzzerBeepUntil > 0 && now >= buzzerBeepUntil) {
    noTone(BUZZER_PIN);
    buzzerBeepUntil = 0;
  }
}

// ============================================================================
// สถานะการไหล / ตัวชี้วัดความไวของเซนเซอร์
// ============================================================================
bool simEnabled() { return simRateIdx > 0; }

int signalMargin() { return abs(valLiquid - valAir); }      // ระยะห่างสัญญาณมี/ไม่มีหยด

// อัตราส่วนสัญญาณต่อสัญญาณรบกวน ยิ่งมากยิ่งจับหยดได้แม่น
int sensitivityRatio() {
  int n = noiseP2P > 0 ? noiseP2P : 1;
  return signalMargin() / n;
}

// คำย่อสำหรับบรรทัดแคบ (ไม่เกิน 6 ตัวอักษร)
const char* sensitivityShort(uint16_t &color) {
  int r = sensitivityRatio();
  if (signalMargin() < 80) { color = COLOR_RED;    return "CALIB!"; }
  if (noiseP2P <= 0)       { color = ST77XX_LIGHTGREY; return "WAIT"; }
  if (r >= 20)             { color = COLOR_GREEN;  return "EXCEL"; }
  if (r >= 10)             { color = THEME_CYAN;   return "GOOD"; }
  if (r >= 5)              { color = COLOR_ORANGE; return "FAIR"; }
  color = COLOR_RED;       return "POOR";
}

const char* sensitivityText(uint16_t &color) {
  int r = sensitivityRatio();
  if (signalMargin() < 80) { color = COLOR_RED;    return "NEED CALIB"; }
  if (noiseP2P <= 0)       { color = ST77XX_LIGHTGREY; return "MEASURING"; }
  if (r >= 20)             { color = COLOR_GREEN;  return "EXCELLENT"; }
  if (r >= 10)             { color = THEME_CYAN;   return "GOOD"; }
  if (r >= 5)              { color = COLOR_ORANGE; return "FAIR"; }
  color = COLOR_RED;       return "POOR";
}

// เวลาที่ไม่มีหยดแล้วถือว่า "หยุดไหล" — อ้างอิงจากจังหวะหยดที่วัดได้จริง
uint32_t calcNoFlowTimeoutMs() {
  uint32_t t = 6000;
  if (currentGttMin > 0.5f) {
    uint32_t d = (uint32_t)((60000.0f / currentGttMin) * 2.5f);
    if (d > t) t = d;
  }
  if (t > 30000) t = 30000;
  return t;
}

bool isNoFlow(unsigned long now) {
  return isRunning && hasFirstDropOccurred && (now - lastDropTimestamp > calcNoFlowTimeoutMs());
}

// ค่าเฉลี่ยและความสม่ำเสมอของจังหวะหยด (CV% ยิ่งน้อยยิ่งไหลสม่ำเสมอ)
float avgIntervalMs() {
  if (intervalCount == 0) return 0.0f;
  float sum = 0;
  for (int i = 0; i < intervalCount; i++) sum += (float)dropIntervals[i];
  return sum / intervalCount;
}

int intervalCvPercent() {
  if (intervalCount < 3) return -1;
  float mean = avgIntervalMs();
  if (mean <= 0) return -1;
  float var = 0;
  for (int i = 0; i < intervalCount; i++) {
    float d = (float)dropIntervals[i] - mean;
    var += d * d;
  }
  var /= intervalCount;
  return (int)((sqrtf(var) / mean) * 100.0f);
}

void pushInterval(uint32_t ms) {
  lastIntervalMs = ms;
  dropIntervals[intervalHead] = ms;
  intervalHead = (intervalHead + 1) % INTERVAL_KEEP;
  if (intervalCount < INTERVAL_KEEP) intervalCount++;
}

// ============================================================================
// โหมดจำลองสัญญาณเซนเซอร์ (SIM) — สร้างรูปคลื่นหยดสังเคราะห์
// ส่งค่าผ่านเส้นทางตรวจจับเดียวกับของจริงทุกขั้นตอน จึงใช้ทดสอบ UI ได้เสมือนจริง
// ============================================================================
void simScheduleNextDrop(unsigned long now) {
  float rate = SIM_RATES[simRateIdx];
  float gttMin = rate * (float)DROP_FACTOR / 60.0f;
  unsigned long interval = (gttMin > 0.1f) ? (unsigned long)(60000.0f / gttMin) : 3000UL;
  long jitter = (long)(interval * 0.08f);
  if (jitter > 0) interval = (unsigned long)((long)interval + random(-jitter, jitter + 1));
  // จำลองภาวะหยุดไหลเป็นระยะ เพื่อให้เห็นกราฟตกและสถานะ NO FLOW
  if (simDropsDone > 0 && (simDropsDone % SIM_PAUSE_EVERY) == 0) interval += 8000UL;
  simNextDropMs = now + interval;
}

int simulateSensorValue(unsigned long now) {
  int span = valAir - valLiquid;                 // บวกเมื่อหยดทำให้ค่าลดลง
  int noiseAmp = abs(span) / 50;
  if (noiseAmp < 3) noiseAmp = 3;

  if (simNextDropMs == 0) simScheduleNextDrop(now);

  if (!simDropActive && now >= simNextDropMs) {
    simDropActive  = true;
    simDropStartMs = now;
  }

  float amp = 0.0f;
  if (simDropActive) {
    unsigned long e = now - simDropStartMs;
    if (e >= SIM_DROP_MS) {
      simDropActive = false;
      simDropsDone++;
      simScheduleNextDrop(now);
    } else {
      amp = sinf(PI * (float)e / (float)SIM_DROP_MS);   // รูปหยดโค้งนุ่ม ไม่ใช่สี่เหลี่ยม
    }
  }

