kittiphun-rut/IV-Monitor-BCNPH/firmware/ESP32-S3-FlowSim-Lab/ESP32-S3-FlowSim-Lab.ino
  int v = valAir - (int)(span * amp) + (int)random(-noiseAmp, noiseAmp + 1);
  if (v < 0) v = 0;
  if (v > 4095) v = 4095;
  return v;
}

int readSensorRaw(unsigned long now) {
  if (simEnabled()) return simulateSensorValue(now);
  return analogRead(SENSOR_AO_PIN);
}

// ============================================================================
// กราฟรูปคลื่น: การแปลงค่า ADC เป็นพิกัดจอ และการวาดทีละคอลัมน์
// (วาดเฉพาะคอลัมน์ใหม่ จึงไม่แย่งเวลา SPI จนพลาดการอ่านหยด)
// ============================================================================
int adcToWaveY(int v) {
  if (plotHigh <= plotLow) return WAVE_Y + WAVE_H - 1;
  if (v < plotLow)  v = plotLow;
  if (v > plotHigh) v = plotHigh;
  long rel = (long)(v - plotLow) * (WAVE_H - 1) / (plotHigh - plotLow);
  return WAVE_Y + WAVE_H - 1 - (int)rel;
}

void refreshWaveGuideLines() {
  threshY  = adcToWaveY(dropThreshold);
  hysUpY   = adcToWaveY(dropThreshold + hysteresis);
  hysDownY = adcToWaveY(dropThreshold - hysteresis);
}

// สเกลแกนตั้งอ้างอิงค่าคาลิเบรต เพื่อให้เส้นเกณฑ์อยู่กลางจอเสมอ
void recomputePlotRange() {
  int lo = min(valLiquid, valAir);
  int hi = max(valLiquid, valAir);
  int pad = (hi - lo) / 4;
  if (pad < 100) pad = 100;
  plotLow  = lo - pad;
  plotHigh = hi + pad;
  if (plotLow < 0) plotLow = 0;
  if (plotHigh > 4095) plotHigh = 4095;
  if (plotHigh - plotLow < 100) plotHigh = plotLow + 100;
  refreshWaveGuideLines();
}

bool expandPlotRange(int v) {
  bool changed = false;
  if (v < plotLow)  { plotLow  = max(0, v - 20);    changed = true; }
  if (v > plotHigh) { plotHigh = min(4095, v + 20); changed = true; }
  if (changed) refreshWaveGuideLines();
  return changed;
}

bool onWavePage() {
  return currentState == STATE_MAIN && currentPage == PAGE_WAVE && !isHoldUiActive && !needRedraw;
}

void drawWaveColumnBase(int col) {
  int x = WAVE_X + col;
  tft.drawFastVLine(x, WAVE_Y, WAVE_H, THEME_BG);
  if ((col & 0x03) == 0) {                                  // จุดกริดแนวนอน 3 เส้น
    for (int g = 1; g <= 3; g++) tft.drawPixel(x, WAVE_Y + (WAVE_H * g) / 4, THEME_DARKBOX);
  }
  if ((col % 6) < 2) {                                      // แถบฮีสเทอรีซิส (โซนกันสัญญาณสั่น)
    tft.drawPixel(x, hysUpY,   ST77XX_DARKGREY);
    tft.drawPixel(x, hysDownY, ST77XX_DARKGREY);
  }
  if ((col % 4) < 2) tft.drawPixel(x, threshY, COLOR_ORANGE); // เส้นเกณฑ์ตัดสินว่าเป็นหยด
}

void drawWaveColumn(int col) {
  drawWaveColumnBase(col);
  if (!waveHas[col]) return;
  int yTop = adcToWaveY((int)waveMax[col]);
  int yBot = adcToWaveY((int)waveMin[col]);
  if (yBot < yTop) { int t = yTop; yTop = yBot; yBot = t; }
  tft.drawFastVLine(WAVE_X + col, yTop, yBot - yTop + 1, waveDrop[col] ? COLOR_YELLOW : THEME_CYAN);
}

void drawPulseColumn(int col) {
  int x = PULSE_X + col;
  tft.drawFastVLine(x, PULSE_Y, PULSE_H, THEME_BG);
  if (!waveHas[col]) return;
  if (waveDrop[col]) tft.drawFastVLine(x, PULSE_Y, PULSE_H, COLOR_GREEN);
  else               tft.drawPixel(x, PULSE_Y + PULSE_H - 1, ST77XX_DARKGREY);
}

void drawWaveCursor(int col) {
  drawWaveColumnBase(col);
  tft.drawFastVLine(WAVE_X + col, WAVE_Y, WAVE_H, THEME_MAROON);
  tft.drawFastVLine(PULSE_X + col, PULSE_Y, PULSE_H, THEME_MAROON);
}

void redrawWholeWave() {
  for (int c = 0; c < WAVE_COLS; c++) { drawWaveColumn(c); drawPulseColumn(c); }
  drawWaveCursor(waveIdx);
}

void clearWaveBuffer() {
  for (int c = 0; c < WAVE_COLS; c++) { waveHas[c] = false; waveDrop[c] = false; waveMin[c] = 0; waveMax[c] = 0; }
  waveIdx = 0;
  bucketMin = 4095; bucketMax = 0; bucketDrop = false; bucketSamples = 0;
}

// ============================================================================
// อ่านเซนเซอร์ + ตรวจจับหยด + เก็บข้อมูลลงบัฟเฟอร์กราฟ (เรียกทุกรอบ loop)
// ============================================================================
void sampleSensorAndDetect(unsigned long now) {
  int sensorValue = readSensorRaw(now);
  rawAdc = sensorValue;

  if (isRunning) {
    bool dropDetected, dropReleased;
    if (dropLowersAdc) {
      dropDetected = sensorValue < dropThreshold;
      dropReleased = sensorValue > (dropThreshold + hysteresis);
    } else {
      dropDetected = sensorValue > dropThreshold;
      dropReleased = sensorValue < (dropThreshold - hysteresis);
    }

    if (!dropState && dropDetected) {
      if (now - lastDebounceTime > MIN_DROP_INTERVAL) {
        dropState = true;
        totalDrops++;
        lastDebounceTime = now;

        if (rateAnchorValid) {
          unsigned long deltaMs = now - lastDropTimestamp;
          if (deltaMs > MIN_DROP_INTERVAL && deltaMs < 60000) {
            pushInterval((uint32_t)deltaMs);
            float instantGttMin  = 60000.0f / (float)deltaMs;
            float instantRateMlHr = (instantGttMin * 60.0f) / (float)DROP_FACTOR;
            if (currentFlowRate_ml_hr == 0.0f) currentFlowRate_ml_hr = instantRateMlHr;
            else currentFlowRate_ml_hr = (instantRateMlHr * 0.75f) + (currentFlowRate_ml_hr * 0.25f);
          }
        }
        rateAnchorValid = true;
        hasFirstDropOccurred = true;
        lastDropTimestamp = now;

        soundDrop();
        ledFlashUntil = now + 60;
        lastLedCode = -1;
        setLedColor(0, 90, 40);
      }
    } else if (dropState && dropReleased) {
      dropState = false;
    }
  }

  // ---- สถิติสัญญาณรบกวนของเส้นฐาน ----
  // วัดช่วงแกว่งของหน้าต่างย่อย 50 ms แล้วเลือก "ค่าน้อยที่สุด" ในรอบ 1 วินาที
  // วิธีนี้ตัดช่วงขอบขาขึ้น-ลงของหยด (ซึ่งกินเวลาไม่กี่หน้าต่างย่อย) ออกไปเองโดยอัตโนมัติ
  if (!dropState) {
    if (sensorValue < noiseSubMin) noiseSubMin = sensorValue;
    if (sensorValue > noiseSubMax) noiseSubMax = sensorValue;
    noiseSubSamples++;
  }
  if (now - noiseSubStart >= 50) {
    if (noiseSubSamples >= 5) {
      int p2p = noiseSubMax - noiseSubMin;
      if (noiseBestP2P < 0 || p2p < noiseBestP2P) noiseBestP2P = p2p;
    }
    noiseSubStart = now;
    noiseSubMin = 4095; noiseSubMax = 0; noiseSubSamples = 0;
  }
  if (now - noiseWinStart >= 1000) {
    if (noiseBestP2P >= 0) noiseP2P = noiseBestP2P;
    noiseBestP2P = -1;
    noiseWinStart = now;
  }

  // ---- เก็บค่าลงคอลัมน์กราฟ (เก็บทั้งค่าต่ำสุด/สูงสุด จึงไม่พลาดยอดแหลม) ----
  if (sensorValue < bucketMin) bucketMin = sensorValue;
  if (sensorValue > bucketMax) bucketMax = sensorValue;
  if (dropState) bucketDrop = true;
  bucketSamples++;

  if (now - lastBucketMs >= WAVE_BUCKET_MS) {
    lastBucketMs = now;
    if (bucketSamples > 0) {
      bool rangeChanged = expandPlotRange(bucketMin) | expandPlotRange(bucketMax);
      waveMin[waveIdx]  = (uint16_t)bucketMin;
      waveMax[waveIdx]  = (uint16_t)bucketMax;
      waveDrop[waveIdx] = bucketDrop;
      waveHas[waveIdx]  = true;

      if (onWavePage()) {
        if (rangeChanged) {
          redrawWholeWave();
        } else {
          drawWaveColumn(waveIdx);
          drawPulseColumn(waveIdx);
          drawWaveCursor((waveIdx + 1) % WAVE_COLS);
        }
      }
      waveIdx = (waveIdx + 1) % WAVE_COLS;
    }
    bucketMin = 4095; bucketMax = 0; bucketDrop = false; bucketSamples = 0;
  }
}

// ============================================================================
// คำนวณอัตราไหล (ลดลงตามจริงเมื่อหยดช้า) และสะสมข้อมูลกราฟแท่ง
// ============================================================================
void updateFlowMath(unsigned long now) {
  if (isRunning && hasFirstDropOccurred && currentFlowRate_ml_hr > 0.0f) {
    unsigned long elapsed = now - lastDropTimestamp;
    float expectedMs = 60000.0f / (currentFlowRate_ml_hr * DROP_FACTOR / 60.0f);
    if (elapsed > expectedMs * 1.5f && elapsed > 0) {
      float capRate = (60000.0f / (float)elapsed) * 60.0f / (float)DROP_FACTOR;
      if (capRate < currentFlowRate_ml_hr) currentFlowRate_ml_hr = capRate;
    }
    if (elapsed > calcNoFlowTimeoutMs()) currentFlowRate_ml_hr = 0.0f;
  }
  if (!isRunning) currentFlowRate_ml_hr = 0.0f;

  currentGttMin = (currentFlowRate_ml_hr * DROP_FACTOR) / 60.0f;
  totalVolumeMl = totalDrops / (float)DROP_FACTOR;
}

void updateTrendAccumulator(unsigned long now) {
  if (now - lastRateSample >= 100) {                 // เก็บตัวอย่างอัตราไหล 10 ครั้ง/วินาที
    lastRateSample = now;
    binRateSum += currentGttMin;
    binRateSamples++;
    binLiveValue = (binRateSamples > 0) ? (binRateSum / binRateSamples) : 0.0f;
  }

  if (now - binStartMs >= TREND_BIN_MS) {
    binStartMs = now;
    trendBin[trendHead] = (binRateSamples > 0) ? (binRateSum / binRateSamples) : 0.0f;
    trendHas[trendHead] = true;
    trendHead = (trendHead + 1) % TREND_BARS;
    binRateSum = 0.0f;
    binRateSamples = 0;
    binLiveValue = 0.0f;
    trendNeedsRedraw = true;
  }
}

void resetAllStatistics() {
  totalDrops = 0;
  currentFlowRate_ml_hr = 0.0f;
  currentGttMin = 0.0f;
  totalVolumeMl = 0.0f;
  hasFirstDropOccurred = false;
  rateAnchorValid = false;
  dropState = false;
  intervalCount = 0;
  intervalHead = 0;
  lastIntervalMs = 0;
  for (int i = 0; i < TREND_BARS; i++) { trendBin[i] = 0.0f; trendHas[i] = false; }
  trendHead = 0;
  binRateSum = 0.0f; binRateSamples = 0; binLiveValue = 0.0f;
  binStartMs = millis();
  trendNeedsRedraw = true;
  clearWaveBuffer();
  needRedraw = true;
  beepNonBlocking(2400, 120);
}

// ============================================================================
// แถบสถานะด้านบน (ใช้ร่วมกันทุกหน้า)
//   ซ้าย = สถานะการนับ / กลาง = ชื่อหน้า / ขวา = โหมดจำลองหรือ Drop factor
// ============================================================================
String runStateText(unsigned long now) {
  if (!isRunning)    return "HOLD";
  if (isNoFlow(now)) return "NOFLOW";
  return "RUN";
}

uint16_t runStateColor(unsigned long now) {
  if (!isRunning)    return COLOR_YELLOW;
  if (isNoFlow(now)) return COLOR_RED;
  return COLOR_GREEN;
}

const char* pageTitle() {
  switch (currentPage) {
    case PAGE_WAVE:   return "WAVEFORM";
    case PAGE_TREND:  return "FLOW TREND";
    default:          return "SENSOR LAB";
  }
}

String badgeText() {
  if (simEnabled()) return "SIM " + String((int)SIM_RATES[simRateIdx]);
  return "DF" + String(DROP_FACTOR);
}

void drawTopBar(unsigned long now, bool forceRedraw) {
  if (forceRedraw) {
    tft.fillRect(0, 0, SCR_W, TOPBAR_H, THEME_NAVY);
    tft.drawFastHLine(0, TOPBAR_H, SCR_W, THEME_CYAN);
    cacheTop1 = ""; cacheTop2 = ""; cacheTop3 = "";
  }

  String s1 = padRight(runStateText(now), 6);
  if (s1 != cacheTop1) {
    cacheTop1 = s1;
    drawStringAt(s1, 5, 7, 1, runStateColor(now), THEME_NAVY);
  }

