kittiphun-rut/IV-Monitor-BCNPH/firmware/ESP32-S3-FlowSim-Lab/ESP32-S3-FlowSim-Lab.ino
  String s2 = pageTitle();
  if (s2 != cacheTop2) {
    cacheTop2 = s2;
    tft.fillRect(46, 5, 78, 12, THEME_NAVY);
    drawCenteredString(s2, 7, 1, COLOR_WHITE, THEME_NAVY);
  }

  String s3 = badgeText();
  if (s3 != cacheTop3) {
    cacheTop3 = s3;
    tft.fillRect(120, 5, 48, 12, THEME_NAVY);
    drawStringRight(s3, 167, 7, 1, simEnabled() ? THEME_PINK : THEME_SKYBLUE, THEME_NAVY);
  }
}

void drawFooterNav() {
  tft.fillRect(0, FOOTER_Y - 2, SCR_W, 20, THEME_BG);
  String nav;
  if (currentPage == PAGE_WAVE)       nav = "[1]Wave 2:Trend 3:Sensor";
  else if (currentPage == PAGE_TREND) nav = "1:Wave [2]Trend 3:Sensor";
  else                                nav = "1:Wave 2:Trend [3]Sensor";
  drawCenteredString(nav, FOOTER_Y, 1, THEME_SKYBLUE, THEME_BG);
}

// ============================================================================
// หน้า 1: WAVEFORM — รูปคลื่นสัญญาณเซนเซอร์ + แถบพัลส์การนับหยด
// ============================================================================
void drawWavePageFramework() {
  tft.fillScreen(THEME_BG);
  drawTopBar(millis(), true);

  // กล่องตัวเลขอัตราไหล
  tft.fillRoundRect(6, 26, 160, 48, 6, THEME_DARKBOX);
  tft.drawRoundRect(6, 26, 160, 48, 6, THEME_SKYBLUE);
  drawStringAt("FLOW", 12, 30, 1, THEME_SKYBLUE, THEME_DARKBOX);
  drawStringAt("gtt/min", 12, 62, 1, THEME_PINK, THEME_DARKBOX);
  drawStringAt("mL/h", 96, 62, 1, THEME_PINK, THEME_DARKBOX);

  // กล่องกราฟรูปคลื่น
  tft.fillRoundRect(6, 78, 160, 120, 6, THEME_BG);
  tft.drawRoundRect(6, 78, 160, 120, 6, THEME_CYAN);
  drawStringAt("SENSOR ADC", 12, 82, 1, THEME_CYAN, THEME_BG);
  drawStringRight("3 s window", 162, 82, 1, ST77XX_DARKGREY, THEME_BG);

  // กล่องแถบพัลส์
  tft.fillRoundRect(6, 202, 160, 34, 6, THEME_BG);
  tft.drawRoundRect(6, 202, 160, 34, 6, COLOR_GREEN);
  drawStringAt("DROP PULSE", 12, 205, 1, COLOR_GREEN, THEME_BG);

  redrawWholeWave();
  drawFooterNav();

  cacheGtt = -999; cacheMlhr = -999;
  cacheP1a = ""; cacheP1b = ""; cacheP1c = "";
}

void drawWavePageDynamic(unsigned long now) {
  drawTopBar(now, false);

  int gtt  = (int)(currentGttMin + 0.5f);
  int mlhr = (int)(currentFlowRate_ml_hr + 0.5f);
  if (gtt != cacheGtt || mlhr != cacheMlhr) {
    cacheGtt = gtt; cacheMlhr = mlhr;
    char buf[8];
    snprintf(buf, sizeof(buf), "%3d", gtt);
    drawStringAt(String(buf), 10, 38, 3, isRunning ? COLOR_WHITE : COLOR_YELLOW, THEME_DARKBOX);
    snprintf(buf, sizeof(buf), "%4d", mlhr);
    drawStringAt(String(buf), 94, 42, 2, isRunning ? COLOR_WHITE : COLOR_YELLOW, THEME_DARKBOX);
  }

  char line[40];
  snprintf(line, sizeof(line), "ADC %4d  TH %4d  HYS %3d", rawAdc, dropThreshold, hysteresis);
  String l1 = padCenter(String(line), 28);
  if (l1 != cacheP1a) { cacheP1a = l1; drawCenteredString(l1, 244, 1, COLOR_WHITE, THEME_BG); }

  float lastSec = (lastIntervalMs > 0) ? (lastIntervalMs / 1000.0f) : 0.0f;
  snprintf(line, sizeof(line), "Last %4.2f s   Drops %lu", lastSec, (unsigned long)totalDrops);
  String l2 = padCenter(String(line), 28);
  if (l2 != cacheP1b) { cacheP1b = l2; drawCenteredString(l2, 260, 1, THEME_SKYBLUE, THEME_BG); }

  uint16_t qColor;
  const char* q = sensitivityShort(qColor);
  snprintf(line, sizeof(line), "Noise %3d  S/N %-3d %s", noiseP2P, sensitivityRatio(), q);
  String l3 = padCenter(String(line), 28);
  if (l3 != cacheP1c) { cacheP1c = l3; drawCenteredString(l3, 276, 1, qColor, THEME_BG); }
}

// ============================================================================
// หน้า 2: FLOW TREND — กราฟแท่งแนวโน้มอัตราไหลย้อนหลัง 60 วินาที
// ============================================================================
float trendValueAt(int i) {                 // i = 0 คือแท่งซ้ายสุด (เก่าสุด)
  int idx = (trendHead + i) % TREND_BARS;
  return trendHas[idx] ? trendBin[idx] : 0.0f;
}

bool trendValidAt(int i) {
  int idx = (trendHead + i) % TREND_BARS;
  return trendHas[idx];
}

float niceScale(float v) {
  float s = 10.0f;
  while (s < v && s < 300.0f) s += (s < 50.0f) ? 10.0f : 25.0f;
  return s;
}

void drawTrendChart() {
  const int chartH = CHART_BOT - CHART_TOP;
  const int chartW = TREND_BARS * CHART_BAR_W;

  float maxV = 1.0f, sum = 0.0f;
  int valid = 0;
  for (int i = 0; i < TREND_BARS - 1; i++) {
    if (!trendValidAt(i + 1)) continue;      // แท่งขวาสุดสงวนไว้ให้ค่าที่กำลังวัดอยู่
    float v = trendValueAt(i + 1);
    if (v > maxV) maxV = v;
    sum += v; valid++;
  }
  if (binLiveValue > maxV) maxV = binLiveValue;
  float scale = niceScale(maxV * 1.15f);
  chartScale = scale;
  float avg = (valid > 0) ? (sum / valid) : 0.0f;

  tft.fillRect(CHART_X - 3, CHART_TOP - 10, chartW + 6, chartH + 24, THEME_BG);

  // เส้นกริดแนวนอน 3 เส้น
  for (int g = 1; g <= 3; g++) {
    int gy = CHART_BOT - (chartH * g) / 4;
    for (int x = CHART_X; x < CHART_X + chartW; x += 4) tft.drawPixel(x, gy, THEME_DARKBOX);
  }

  // แท่งกราฟ: 29 แท่งที่ปิดช่วงแล้ว + แท่งขวาสุดคือช่วงที่กำลังวัด
  for (int i = 0; i < TREND_BARS; i++) {
    bool isLive = (i == TREND_BARS - 1);
    float v = isLive ? binLiveValue : trendValueAt(i + 1);
    bool has = isLive ? true : trendValidAt(i + 1);
    int h = (int)((v / scale) * chartH);
    if (h > chartH) h = chartH;
    int x = CHART_X + i * CHART_BAR_W;
    if (!has) {
      tft.drawFastHLine(x, CHART_BOT, CHART_BAR_W - 1, THEME_DARKBOX);
    } else if (h <= 1) {
      tft.drawFastHLine(x, CHART_BOT, CHART_BAR_W - 1, COLOR_RED);   // ช่วงที่ไม่มีการไหล
    } else {
      uint16_t c = isLive ? THEME_PINK : THEME_CYAN;
      tft.fillRect(x, CHART_BOT - h, CHART_BAR_W - 1, h, c);
    }
  }

  // เส้นค่าเฉลี่ยของหน้าต่างเวลา
  if (avg > 0.5f) {
    int ay = CHART_BOT - (int)((avg / scale) * chartH);
    if (ay < CHART_TOP) ay = CHART_TOP;
    for (int x = CHART_X; x < CHART_X + chartW; x += 6) tft.drawFastHLine(x, ay, 3, COLOR_YELLOW);
  }

  tft.drawFastHLine(CHART_X - 2, CHART_BOT + 1, chartW + 4, ST77XX_LIGHTGREY);
  drawStringAt(padRight(String((int)scale), 4), CHART_X, CHART_TOP - 10, 1, ST77XX_LIGHTGREY, THEME_BG);
  drawStringAt("-60s", CHART_X, CHART_BOT + 5, 1, ST77XX_DARKGREY, THEME_BG);
  drawStringRight("now", CHART_X + chartW, CHART_BOT + 5, 1, ST77XX_DARKGREY, THEME_BG);
  trendNeedsRedraw = false;
}

// วาดใหม่เฉพาะแท่งขวาสุด (ช่วงที่กำลังวัดอยู่) เพื่อให้กราฟขยับลื่นโดยไม่กะพริบทั้งภาพ
void drawTrendLiveBar() {
  if (binLiveValue > chartScale) { drawTrendChart(); return; }
  const int chartH = CHART_BOT - CHART_TOP;
  int x = CHART_X + (TREND_BARS - 1) * CHART_BAR_W;
  int h = (int)((binLiveValue / chartScale) * chartH);
  if (h > chartH) h = chartH;
  tft.fillRect(x, CHART_TOP, CHART_BAR_W - 1, chartH, THEME_BG);
  for (int g = 1; g <= 3; g++) {
    int gy = CHART_BOT - (chartH * g) / 4;
    if (((x - CHART_X) & 0x03) == 0) tft.drawPixel(x, gy, THEME_DARKBOX);
  }
  if (h <= 1) tft.drawFastHLine(x, CHART_BOT, CHART_BAR_W - 1, COLOR_RED);
  else        tft.fillRect(x, CHART_BOT - h, CHART_BAR_W - 1, h, THEME_PINK);
}

void drawTrendPageFramework() {
  tft.fillScreen(THEME_BG);
  drawTopBar(millis(), true);

