kittiphun-rut/IV-Monitor-BCNPH/firmware/ESP32-S3-FlowSim-Lab/ESP32-S3-FlowSim-Lab.ino
  tft.fillRoundRect(6, 26, 160, 54, 6, THEME_DARKBOX);
  tft.drawRoundRect(6, 26, 160, 54, 6, THEME_PINK);
  drawStringAt("gtt/min", 12, 62, 1, THEME_PINK, THEME_DARKBOX);

  tft.fillRoundRect(6, 86, 160, 152, 6, THEME_BG);
  tft.drawRoundRect(6, 86, 160, 152, 6, THEME_CYAN);
  drawStringAt("TREND", 12, 90, 1, THEME_CYAN, THEME_BG);
  drawStringRight("2 s / bar", 162, 90, 1, ST77XX_DARKGREY, THEME_BG);

  drawTrendChart();
  drawFooterNav();

  cacheGtt = -999; cacheP2kpi = ""; cacheP2a = ""; cacheP2b = ""; cacheP2c = "";
}

void drawTrendPageDynamic(unsigned long now) {
  drawTopBar(now, false);

  int gtt = (int)(currentGttMin + 0.5f);
  if (gtt != cacheGtt) {
    cacheGtt = gtt;
    char buf[8];
    snprintf(buf, sizeof(buf), "%3d", gtt);
    drawStringAt(String(buf), 12, 34, 3, isRunning ? COLOR_WHITE : COLOR_YELLOW, THEME_DARKBOX);
  }

  char kpi[40];
  snprintf(kpi, sizeof(kpi), "%4d mL/h", (int)(currentFlowRate_ml_hr + 0.5f));
  String k1 = String(kpi);
  snprintf(kpi, sizeof(kpi), "%4d drops", (int)totalDrops);
  String k2 = String(kpi);
  snprintf(kpi, sizeof(kpi), "%5.1f mL", totalVolumeMl);
  String k3 = String(kpi);
  String kAll = k1 + k2 + k3;
  if (kAll != cacheP2kpi) {
    cacheP2kpi = kAll;
    drawStringAt(padRight(k1, 10), 88, 34, 1, COLOR_WHITE,   THEME_DARKBOX);
    drawStringAt(padRight(k2, 10), 88, 48, 1, THEME_SKYBLUE, THEME_DARKBOX);
    drawStringAt(padRight(k3, 10), 88, 62, 1, COLOR_GREEN,   THEME_DARKBOX);
  }

  // สรุปหน้าต่างเวลา 60 วินาที
  float mx = 0.0f, mn = 9999.0f, sum = 0.0f;
  int valid = 0;
  for (int i = 1; i < TREND_BARS; i++) {
    if (!trendValidAt(i)) continue;
    float v = trendValueAt(i);
    if (v > mx) mx = v;
    if (v < mn) mn = v;
    sum += v; valid++;
  }
  if (valid == 0) { mn = 0.0f; mx = 0.0f; }
  float avg = (valid > 0) ? sum / valid : 0.0f;

  char line[40];
  snprintf(line, sizeof(line), "Max %3d  Min %3d  Avg %3d", (int)(mx + 0.5f), (int)(mn + 0.5f), (int)(avg + 0.5f));
  String l1 = padCenter(String(line), 28);
  if (l1 != cacheP2a) { cacheP2a = l1; drawCenteredString(l1, 246, 1, COLOR_WHITE, THEME_BG); }

  int cv = intervalCvPercent();
  float ai = avgIntervalMs() / 1000.0f;
  if (cv >= 0) snprintf(line, sizeof(line), "Interval %4.2f s  CV %2d %%", ai, cv);
  else         snprintf(line, sizeof(line), "Interval --      CV --");
  String l2 = padCenter(String(line), 28);
  if (l2 != cacheP2b) {
    cacheP2b = l2;
    uint16_t c = (cv < 0) ? ST77XX_LIGHTGREY : (cv <= 10 ? COLOR_GREEN : (cv <= 25 ? COLOR_ORANGE : COLOR_RED));
    drawCenteredString(l2, 262, 1, c, THEME_BG);
  }

  String l3 = padCenter(isNoFlow(now) ? String("** NO FLOW DETECTED **")
                                      : (isRunning ? String("Counting...") : String("Paused (2 clicks = run)")), 28);
  if (l3 != cacheP2c) {
    cacheP2c = l3;
    drawCenteredString(l3, 278, 1, isNoFlow(now) ? COLOR_RED : (isRunning ? COLOR_GREEN : COLOR_YELLOW), THEME_BG);
  }

  if (trendNeedsRedraw) drawTrendChart();
  else                  drawTrendLiveBar();
}

// ============================================================================
// หน้า 3: SENSOR LAB — ค่าคาลิเบรต เกจสัญญาณสด และคะแนนความไวของเซนเซอร์
// ============================================================================
void drawSensorGauge(int adcValue) {
  const int gx = 16, gy = 84, gw = 140, gh = 14;
  int lo = min(valLiquid, valAir);
  int hi = max(valLiquid, valAir);
  int pad = (hi - lo) / 5;
  if (pad < 50) pad = 50;
  int lowEnd = lo - pad, highEnd = hi + pad;
  if (highEnd <= lowEnd) highEnd = lowEnd + 100;

  tft.fillRect(gx, gy, gw, gh, THEME_BG);
  tft.drawRect(gx - 1, gy - 1, gw + 2, gh + 2, ST77XX_DARKGREY);

  // โซนฮีสเทอรีซิสรอบเส้นเกณฑ์ตัดสิน
  int hx1 = gx + (long)(dropThreshold - hysteresis - lowEnd) * gw / (highEnd - lowEnd);
  int hx2 = gx + (long)(dropThreshold + hysteresis - lowEnd) * gw / (highEnd - lowEnd);
  if (hx1 < gx) hx1 = gx;
  if (hx2 > gx + gw) hx2 = gx + gw;
  if (hx2 > hx1) tft.fillRect(hx1, gy, hx2 - hx1, gh, THEME_DARKBOX);

  // เครื่องหมายค่าอ้างอิงและเส้นเกณฑ์
  int lx = gx + (long)(valLiquid - lowEnd) * gw / (highEnd - lowEnd);
  int ax = gx + (long)(valAir    - lowEnd) * gw / (highEnd - lowEnd);
  int tx = gx + (long)(dropThreshold - lowEnd) * gw / (highEnd - lowEnd);
  tft.drawFastVLine(lx, gy, gh, THEME_CYAN);
  tft.drawFastVLine(ax, gy, gh, THEME_SKYBLUE);
  tft.drawFastVLine(tx, gy, gh, COLOR_ORANGE);

  // ตำแหน่งค่าที่อ่านได้ตอนนี้
  int px = gx + (long)(adcValue - lowEnd) * gw / (highEnd - lowEnd);
  if (px < gx) px = gx;
  if (px > gx + gw - 3) px = gx + gw - 3;
  tft.fillRect(px - 1, gy - 3, 3, gh + 6, dropState ? COLOR_YELLOW : COLOR_WHITE);
}

void drawSensorPageFramework() {
  tft.fillScreen(THEME_BG);
  drawTopBar(millis(), true);

  tft.fillRoundRect(6, 26, 160, 92, 6, THEME_DARKBOX);
  tft.drawRoundRect(6, 26, 160, 92, 6, THEME_SKYBLUE);
  drawStringAt("LIVE SENSOR ADC", 12, 30, 1, THEME_SKYBLUE, THEME_DARKBOX);
  drawStringAt("LIQ", 16, 102, 1, THEME_CYAN, THEME_DARKBOX);
  drawCenteredString("TH", 102, 1, COLOR_ORANGE, THEME_DARKBOX);
  drawStringRight("AIR", 156, 102, 1, THEME_SKYBLUE, THEME_DARKBOX);

  tft.fillRoundRect(6, 124, 160, 86, 6, THEME_NAVY);
  tft.drawRoundRect(6, 124, 160, 86, 6, THEME_PINK);
  drawStringAt("CALIBRATION", 12, 128, 1, THEME_PINK, THEME_NAVY);

  tft.fillRoundRect(6, 216, 160, 76, 6, THEME_DARKBOX);
  tft.drawRoundRect(6, 216, 160, 76, 6, COLOR_GREEN);
  drawStringAt("SENSITIVITY", 12, 220, 1, COLOR_GREEN, THEME_DARKBOX);

  drawFooterNav();
  cacheP3big = ""; cacheP3a = ""; cacheP3b = ""; cacheP3c = ""; cacheGaugeAdc = -999;
}

void drawSensorPageDynamic(unsigned long now) {
  drawTopBar(now, false);

  char buf[40];
  snprintf(buf, sizeof(buf), "%4d", rawAdc);
  String big = String(buf);
  if (big != cacheP3big) {
    cacheP3big = big;
    drawCenteredString(big, 46, 4, dropState ? COLOR_YELLOW : COLOR_WHITE, THEME_DARKBOX);
  }
  if (abs(rawAdc - cacheGaugeAdc) >= 2) {
    cacheGaugeAdc = rawAdc;
    drawSensorGauge(rawAdc);
  }

  // กล่องค่าคาลิเบรต
  char l1[40], l2[40], l3[40];
  snprintf(l1, sizeof(l1), "Liquid %4d   Air %4d", valLiquid, valAir);
  snprintf(l2, sizeof(l2), "Thresh %4d   Hys %3d", dropThreshold, hysteresis);
  snprintf(l3, sizeof(l3), "Drop = %s ADC", dropLowersAdc ? "LOW " : "HIGH");
  String block = String(l1) + String(l2) + String(l3);
  if (block != cacheP3a) {
    cacheP3a = block;
    drawStringAt(padRight(String(l1), 24), 12, 146, 1, COLOR_WHITE,   THEME_NAVY);
    drawStringAt(padRight(String(l2), 24), 12, 162, 1, COLOR_WHITE,   THEME_NAVY);
    drawStringAt(padRight(String(l3), 24), 12, 178, 1, THEME_SKYBLUE, THEME_NAVY);
    snprintf(buf, sizeof(buf), "Signal margin %4d ADC", signalMargin());
    drawStringAt(padRight(String(buf), 24), 12, 194, 1,
                 signalMargin() >= 300 ? COLOR_GREEN : (signalMargin() >= 80 ? COLOR_ORANGE : COLOR_RED), THEME_NAVY);
  }

  // กล่องความไว
  uint16_t qColor;
  const char* q = sensitivityText(qColor);
  snprintf(buf, sizeof(buf), "Noise p-p %3d ADC", noiseP2P);
  String s1 = padRight(String(buf), 24);
  if (s1 != cacheP3b) { cacheP3b = s1; drawStringAt(s1, 12, 238, 1, COLOR_WHITE, THEME_DARKBOX); }

