kittiphun-rut/IV-Monitor-BCNPH/firmware/ESP32-S3-FlowSim-Lab/ESP32-S3-FlowSim-Lab.ino
  snprintf(buf, sizeof(buf), "Ratio x%-4d %s", sensitivityRatio(), q);
  String s2 = padRight(String(buf), 24);
  if (s2 != cacheP3c) {
    cacheP3c = s2;
    drawStringAt(s2, 12, 254, 1, qColor, THEME_DARKBOX);
    float lastSec = (lastIntervalMs > 0) ? (lastIntervalMs / 1000.0f) : 0.0f;
    snprintf(buf, sizeof(buf), "Drops %-5lu Last %4.2f s", (unsigned long)totalDrops, lastSec);
    drawStringAt(padRight(String(buf), 24), 12, 270, 1, THEME_SKYBLUE, THEME_DARKBOX);
  }
}

// ============================================================================
// หน้าวิธีใช้ / ผู้พัฒนา (กดปุ่มค้าง 5 วินาที)
// ============================================================================
void drawAboutScreen() {
  tft.fillScreen(THEME_MAROON);
  tft.drawRoundRect(4, 4, 164, 312, 8, COLOR_WHITE);
  tft.drawRoundRect(6, 6, 160, 308, 6, COLOR_ORANGE);
  tft.fillRoundRect(12, 14, 148, 30, 6, 0x3800);
  drawCenteredString("HOW TO USE", 22, 2, COLOR_YELLOW, 0x3800);

  drawStringAt("1 click  : change page",   14, 56,  1, COLOR_WHITE,   THEME_MAROON);
  drawStringAt("2 clicks : RUN / HOLD",    14, 72,  1, COLOR_WHITE,   THEME_MAROON);
  drawStringAt("3 clicks : reset stats",   14, 88,  1, COLOR_WHITE,   THEME_MAROON);
  drawStringAt("4 clicks : SIM mode/rate", 14, 104, 1, THEME_SKYBLUE, THEME_MAROON);
  drawStringAt("hold 3 s : CALIBRATION",   14, 120, 1, COLOR_YELLOW,  THEME_MAROON);
  drawStringAt("hold 5 s : this screen",   14, 136, 1, ST77XX_LIGHTGREY, THEME_MAROON);

  tft.drawFastHLine(16, 154, 140, COLOR_ORANGE);
  drawCenteredString("PAGES", 162, 1, COLOR_ORANGE, THEME_MAROON);
  drawStringAt("1 WAVE  : live ADC signal",  14, 178, 1, COLOR_WHITE, THEME_MAROON);
  drawStringAt("2 TREND : flow bar graph",   14, 194, 1, COLOR_WHITE, THEME_MAROON);
  drawStringAt("3 SENSOR: calib + quality",  14, 210, 1, COLOR_WHITE, THEME_MAROON);

  tft.drawFastHLine(16, 228, 140, COLOR_ORANGE);
  drawCenteredString("Smart IV Alert - Flow Lab", 236, 1, COLOR_WHITE, THEME_MAROON);
  drawCenteredString("Developer", 252, 1, COLOR_ORANGE, THEME_MAROON);
  drawCenteredString("Kittiphan Rattanakorn", 266, 1, COLOR_YELLOW, THEME_MAROON);
  drawCenteredString("BCN Phrae Innovation", 280, 1, THEME_SKYBLUE, THEME_MAROON);

  tft.fillRoundRect(14, 294, 144, 18, 4, 0x3800);
  drawCenteredString("FW v" APP_VERSION "  [CLICK=BACK]", 299, 1, COLOR_WHITE, 0x3800);
  needRedraw = false;
}

// ============================================================================
// HUD ขณะกดปุ่มค้าง
// ============================================================================
void drawHoldProgressHUD(unsigned long holdDur) {
  int boxX = 6, boxY = 110, boxW = 160, boxH = 100;
  tft.fillRoundRect(boxX, boxY, boxW, boxH, 8, THEME_NAVY);
  tft.drawRoundRect(boxX, boxY, boxW, boxH, 8, THEME_CYAN);

  int barX = boxX + 15, barY = boxY + 48, barW = 130, barH = 12;

  if (holdDur < 3000) {
    int fill = map((long)holdDur, 400, 3000, 0, barW);
    if (fill < 0) fill = 0;
    if (fill > barW) fill = barW;
    drawCenteredString("BUTTON HOLDING", boxY + 12, 1, THEME_SKYBLUE, THEME_NAVY);
    drawCenteredString("-> CALIBRATE (3s)", boxY + 28, 1, COLOR_YELLOW, THEME_NAVY);
    tft.drawRect(barX, barY, barW, barH, COLOR_WHITE);
    tft.fillRect(barX + 1, barY + 1, fill, barH - 2, THEME_PINK);
    tft.fillRect(barX + 1 + fill, barY + 1, barW - fill - 2, barH - 2, THEME_NAVY);
    drawCenteredString("Release <3s = Cancel", boxY + 82, 1, ST77XX_LIGHTGREY, THEME_NAVY);
  } else if (holdDur < 5000) {
    int fill = map((long)holdDur, 3000, 5000, 0, barW);
    if (fill < 0) fill = 0;
    if (fill > barW) fill = barW;
    drawCenteredString("RELEASE = CALIB", boxY + 12, 1, COLOR_GREEN, THEME_NAVY);
    drawCenteredString("-> HOW TO USE (5s)", boxY + 28, 1, THEME_PINK, THEME_NAVY);
    tft.drawRect(barX, barY, barW, barH, COLOR_WHITE);
    tft.fillRect(barX + 1, barY + 1, fill, barH - 2, THEME_CYAN);
    tft.fillRect(barX + 1 + fill, barY + 1, barW - fill - 2, barH - 2, THEME_NAVY);
    drawCenteredString("Release now = Calib", boxY + 82, 1, ST77XX_LIGHTGREY, THEME_NAVY);
  } else {
    drawCenteredString(">> HOW TO USE <<", boxY + 14, 1, COLOR_GREEN, THEME_NAVY);
    drawCenteredString("RELEASE TO VIEW", boxY + 30, 1, COLOR_YELLOW, THEME_NAVY);
    tft.drawRect(barX, barY, barW, barH, COLOR_WHITE);
    tft.fillRect(barX + 1, barY + 1, barW - 2, barH - 2, COLOR_GREEN);
  }
}

// ============================================================================
// Calibration Wizard — วัดค่าอ้างอิง 2 จุด แล้วคำนวณเกณฑ์ตัดสิน/ฮีสเทอรีซิส
// (โหมดโมดัล: หยุดงานอื่นชั่วคราวจนกว่าจะทำเสร็จ)
// ============================================================================
int sampleSensorAveragePrecise(int samples = 50) {
  long sum = 0;
  for (int i = 0; i < samples; i++) {
    sum += analogRead(SENSOR_AO_PIN);
    delayMicroseconds(500);
  }
  return (int)(sum / samples);
}

// รอผู้ใช้กดปุ่มพร้อมแสดงค่า ADC สดและช่วงแกว่ง เพื่อให้ตั้งตำแหน่งเซนเซอร์ได้นิ่งก่อนเก็บค่า
int waitAndMonitorSensorStep(const char* stepTitle, const char* stepDescTh, const char* stepDescEn, uint16_t boxColor) {
  noTone(BUZZER_PIN);
  buzzerBeepUntil = 0;

  tft.fillRoundRect(6, 36, 160, 152, 8, THEME_DARKBOX);
  tft.drawRoundRect(6, 36, 160, 152, 8, boxColor);
  drawCenteredString(stepTitle, 44, 1, COLOR_YELLOW, THEME_DARKBOX);
  drawCenteredString(stepDescEn, 60, 2, COLOR_WHITE, THEME_DARKBOX);
  drawCenteredString(stepDescTh, 82, 1, THEME_PINK, THEME_DARKBOX);

  tft.fillRoundRect(20, 102, 132, 44, 6, THEME_NAVY);
  tft.drawRoundRect(20, 102, 132, 44, 6, boxColor);
  drawCenteredString("SENSOR LIVE ADC", 106, 1, THEME_SKYBLUE, THEME_NAVY);
  drawCenteredString("Hold steady, then click", 170, 1, COLOR_WHITE, THEME_DARKBOX);

  unsigned long lastAdcUpdate = 0, winStart = millis();
  int lastVal = -1, wMin = 4095, wMax = 0, shownSpread = -1;

  while (digitalRead(BTN_PIN) == HIGH) {
    int liveAdc = analogRead(SENSOR_AO_PIN);
    if (liveAdc < wMin) wMin = liveAdc;
    if (liveAdc > wMax) wMax = liveAdc;

    if (millis() - lastAdcUpdate >= 60) {
      lastAdcUpdate = millis();
      if (liveAdc != lastVal) {
        lastVal = liveAdc;
        tft.fillRect(24, 120, 124, 20, THEME_NAVY);
        drawCenteredString(String(liveAdc), 120, 2, COLOR_WHITE, THEME_NAVY);
      }
    }
    if (millis() - winStart >= 800) {          // รายงานความนิ่งของสัญญาณทุก 0.8 วินาที
      winStart = millis();
      int spread = wMax - wMin;
      if (spread != shownSpread) {
        shownSpread = spread;
        String txt = "Stability +/- " + String(spread) + " ADC";
        drawCenteredString(padCenter(txt, 26), 152, 1,
                           (spread <= 20) ? COLOR_GREEN : (spread <= 60 ? COLOR_ORANGE : COLOR_RED), THEME_DARKBOX);
      }
      wMin = 4095; wMax = 0;
    }
    delay(5);
  }

  modalSafeBeep(2400, 40);
  while (digitalRead(BTN_PIN) == LOW) delay(10);
  delay(60);

  tft.fillRect(20, 102, 132, 44, THEME_NAVY);
  drawCenteredString("SAMPLING...", 118, 1, COLOR_YELLOW, THEME_NAVY);
  int avgVal = sampleSensorAveragePrecise(50);
  modalSafeBeep(1800, 60);
  return avgVal;
}

