kittiphun-rut/IV-Monitor-BCNPH/firmware/ESP32-S3-FlowSim-Lab/ESP32-S3-FlowSim-Lab.ino
void executeCalibrationWizard() {
  noTone(BUZZER_PIN);
  buzzerBeepUntil = 0;

  tft.fillScreen(THEME_BG);
  tft.fillRect(0, 0, SCR_W, 28, THEME_PINK);
  drawCenteredString("CALIBRATION WIZARD", 8, 1, COLOR_WHITE, THEME_PINK);

  // โหมดจำลองใช้สัญญาณสังเคราะห์ จึงคาลิเบรตไม่ได้ ต้องปิดก่อน
  if (simEnabled()) {
    tft.fillRoundRect(6, 60, 160, 140, 8, THEME_NAVY);
    tft.drawRoundRect(6, 60, 160, 140, 8, COLOR_RED);
    drawCenteredString("SIM MODE IS ON", 80, 2, COLOR_RED, THEME_NAVY);
    drawCenteredString("Calibration needs", 116, 1, COLOR_WHITE, THEME_NAVY);
    drawCenteredString("the real sensor.", 132, 1, COLOR_WHITE, THEME_NAVY);
    drawCenteredString("Turn SIM off first", 152, 1, THEME_PINK, THEME_NAVY);
    drawCenteredString("4 clicks = SIM off", 172, 1, COLOR_YELLOW, THEME_NAVY);
    modalSafeBeep(800, 200);
    delay(2200);
    needRedraw = true;
    return;
  }

  int newLiquid = waitAndMonitorSensorStep("STEP 1 OF 2", "Chamber shows liquid", "FILL LIQUID", THEME_SKYBLUE);
  int newAir    = waitAndMonitorSensorStep("STEP 2 OF 2", "Chamber shows air only", "EMPTY CHAMBER", THEME_PINK);

  int diff = abs(newLiquid - newAir);
  tft.fillRoundRect(6, 196, 160, 116, 8, THEME_NAVY);
  tft.drawRoundRect(6, 196, 160, 116, 8, (diff >= 80) ? COLOR_GREEN : COLOR_RED);

  if (diff >= 80) {
    valLiquid     = newLiquid;
    valAir        = newAir;
    dropThreshold = (valLiquid + valAir) / 2;
    dropLowersAdc = (valLiquid < valAir);      // รองรับเซนเซอร์ทั้งสองขั้ว
    hysteresis    = (int)(diff * 0.20f);
    if (hysteresis < 60)  hysteresis = 60;
    if (hysteresis > 300) hysteresis = 300;

    labPrefs.begin("st_cal", false);
    labPrefs.putInt("v_liq", valLiquid);
    labPrefs.putInt("v_air", valAir);
    labPrefs.putInt("th", dropThreshold);
    labPrefs.putInt("hys", hysteresis);
    labPrefs.end();

    recomputePlotRange();
    clearWaveBuffer();

    drawCenteredString("CALIBRATION OK!", 206, 1, COLOR_GREEN, THEME_NAVY);
    drawCenteredString("SIGNAL MARGIN", 222, 1, THEME_SKYBLUE, THEME_NAVY);
    drawCenteredString(String(diff) + " ADC", 234, 2, COLOR_WHITE, THEME_NAVY);
    drawCenteredString("Thresh " + String(dropThreshold) + " / Hys " + String(hysteresis), 258, 1, THEME_SKYBLUE, THEME_NAVY);
    drawCenteredString(dropLowersAdc ? "Mode: drop = LOW ADC" : "Mode: drop = HIGH ADC", 274, 1, COLOR_WHITE, THEME_NAVY);
    drawCenteredString("Saved to flash", 292, 1, ST77XX_LIGHTGREY, THEME_NAVY);
    modalSafeBeep(2000, 100);
    delay(100);
    modalSafeBeep(2500, 150);
    delay(1800);
  } else {
    drawCenteredString("CALIB FAILED", 210, 2, COLOR_RED, THEME_NAVY);
    drawCenteredString("Margin " + String(diff) + " ADC (min 80)", 238, 1, COLOR_WHITE, THEME_NAVY);
    drawCenteredString("Check sensor position", 260, 1, COLOR_YELLOW, THEME_NAVY);
    drawCenteredString("Keep previous values", 280, 1, COLOR_WHITE, THEME_NAVY);
    modalSafeBeep(800, 200);
    delay(1800);
  }

  dropState = false;
  lastDebounceTime = millis();
  needRedraw = true;
}

// ============================================================================
// ปุ่มกดเดียว: คลิก 1-4 ครั้ง และกดค้าง
// ============================================================================
void cycleSimulationMode() {
  simRateIdx = (simRateIdx + 1) % SIM_RATE_COUNT;
  simDropActive = false;
  simDropsDone  = 0;
  simNextDropMs = 0;
  dropState = false;
  clearWaveBuffer();
  needRedraw = true;
  beepNonBlocking(simEnabled() ? 2400 : 1200, 90);
}

void handleButton() {
  static unsigned long btnPressStart = 0;
  static bool isHolding = false;
  static int clickCount = 0;
  static unsigned long lastReleaseTime = 0;

  bool reading = (digitalRead(BTN_PIN) == LOW);
  unsigned long now = millis();

  if (reading && !isHolding) {
    btnPressStart = now;
    isHolding = true;
    isHoldUiActive = false;
    holdBeep3sDone = false;
    holdBeep5sDone = false;
  }
  else if (reading && isHolding) {
    unsigned long holdDur = now - btnPressStart;
    if (holdDur >= 400) {
      isHoldUiActive = true;
      if (holdDur >= 3000 && !holdBeep3sDone) { beepNonBlocking(2200, 50); holdBeep3sDone = true; }
      if (holdDur >= 5000 && !holdBeep5sDone) { beepNonBlocking(2600, 80); holdBeep5sDone = true; }
      if (now - lastHoldRenderTime >= 35) {
        lastHoldRenderTime = now;
        drawHoldProgressHUD(holdDur);
      }
    }
  }
  else if (!reading && isHolding) {
    unsigned long pressDur = now - btnPressStart;
    isHolding = false;

    if (isHoldUiActive) {
      isHoldUiActive = false;
      clickCount = 0;
      if (pressDur >= 5000) {
        soundClick();
        currentState = STATE_ABOUT;
        needRedraw = true;
      } else if (pressDur >= 3000) {
        executeCalibrationWizard();
        currentState = STATE_MAIN;
      } else {
        soundClick();
        needRedraw = true;       // ยกเลิก: วาดหน้าเดิมกลับมาทับ HUD
      }
      return;
    }
    else if (pressDur > 30 && pressDur < 400) {
      clickCount++;
      lastReleaseTime = now;
    }
  }

  if (clickCount > 0 && !isHolding && (now - lastReleaseTime > 320)) {
    if (currentState == STATE_ABOUT) {          // หน้าวิธีใช้: คลิกกี่ครั้งก็กลับหน้าหลัก
      soundClick();
      currentState = STATE_MAIN;
      needRedraw = true;
      clickCount = 0;
      return;
    }

    if (clickCount >= 4) {
      cycleSimulationMode();
    }
    else if (clickCount == 3) {
      resetAllStatistics();
    }
    else if (clickCount == 2) {
      isRunning = !isRunning;
      currentFlowRate_ml_hr = 0.0f;
      dropState = false;
      if (isRunning) {
        rateAnchorValid = false;               // ไม่นำช่วงที่พักไว้มาคำนวณอัตราไหล
        lastDropTimestamp = now;
        soundStart();
      } else {
        soundStop();
      }
      needRedraw = true;
    }
    else {
      currentPage = (currentPage % 3) + 1;
      needRedraw = true;
      soundClick();
    }
    clickCount = 0;
  }
}

// ============================================================================
// ไฟ LED บอกสถานะ: เขียว=ปกติ เหลือง=พักการนับ แดง=ไม่มีการไหล ม่วง=โหมดจำลอง
// ============================================================================
void updateStatusLed(unsigned long now) {
  if (ledFlashUntil > 0) {
    if (now < ledFlashUntil) return;
    ledFlashUntil = 0;
    lastLedCode = -1;
  }
  int code;
  if (!isRunning)          code = 1;
  else if (isNoFlow(now))  code = 2;
  else if (simEnabled())   code = 3;
  else                     code = 4;
  if (code == lastLedCode) return;
  lastLedCode = code;
  switch (code) {
    case 1:  setLedColor(50, 40, 0); break;
    case 2:  setLedColor(90, 0, 0);  break;
    case 3:  setLedColor(40, 0, 60); break;
    default: setLedColor(0, 35, 0);  break;
  }
}

// ============================================================================
// setup / loop
// ============================================================================
void drawSplashScreen() {
  tft.fillScreen(THEME_BG);
  tft.drawRoundRect(4, 4, 164, 312, 8, THEME_SKYBLUE);
  tft.drawRoundRect(6, 6, 160, 308, 6, THEME_PINK);

