kittiphun-rut/IV-Monitor-BCNPH/firmware/ESP32-S3-FlowSim-Lab/ESP32-S3-FlowSim-Lab.ino
  drawCenteredString("SMART IV", 40, 3, THEME_SKYBLUE, THEME_BG);
  drawCenteredString("FLOW LAB", 70, 2, THEME_PINK, THEME_BG);

  tft.fillRoundRect(16, 118, 140, 56, 6, THEME_PINK);
  drawCenteredString("SIMULATION", 128, 2, COLOR_WHITE, THEME_PINK);
  drawCenteredString("& SENSOR TEST", 150, 1, COLOR_WHITE, THEME_PINK);

  drawCenteredString("Drop counting + Calibration", 196, 1, COLOR_WHITE, THEME_BG);
  drawCenteredString("Waveform & Trend graph", 214, 1, THEME_CYAN, THEME_BG);
  drawCenteredString("NO HOST / NO WIRELESS", 232, 1, COLOR_YELLOW, THEME_BG);
  drawCenteredString("Firmware v" APP_VERSION, 256, 1, THEME_SKYBLUE, THEME_BG);
  drawCenteredString("Hold 5 s = how to use", 284, 1, ST77XX_LIGHTGREY, THEME_BG);
}

void setup() {
  Serial.begin(115200);

  pinMode(BUZZER_PIN, OUTPUT); noTone(BUZZER_PIN);
  pinMode(TFT_BLK, OUTPUT); digitalWrite(TFT_BLK, HIGH);
  pinMode(BTN_PIN, INPUT_PULLUP);
  pinMode(SENSOR_AO_PIN, INPUT);

  analogReadResolution(12);
  analogSetAttenuation(ADC_11db);
  randomSeed((uint32_t)analogRead(SENSOR_AO_PIN) ^ micros());

  SPI_TFT.begin(TFT_SCLK, -1, TFT_MOSI, TFT_CS);
  tft.init(SCR_W, SCR_H);
  tft.setSPISpeed(40000000);
  tft.setRotation(0);
  tft.setTextWrap(false);

  // อ่านค่าคาลิเบรตเดิม (ใช้ namespace เดียวกับเฟิร์มแวร์เครื่องจริง จึงย้ายเครื่องมาทดสอบได้ทันที)
  labPrefs.begin("st_cal", true);
  valLiquid     = labPrefs.getInt("v_liq", 1200);
  valAir        = labPrefs.getInt("v_air", 2800);
  dropThreshold = labPrefs.getInt("th", 2000);
  hysteresis    = labPrefs.getInt("hys", 200);
  labPrefs.end();
  dropLowersAdc = (valLiquid < valAir);

  setLedColor(0, 40, 80);
  drawSplashScreen();
  playWelcomeMelody();
  delay(1200);

  unsigned long now = millis();
  recomputePlotRange();
  clearWaveBuffer();
  for (int i = 0; i < TREND_BARS; i++) { trendBin[i] = 0.0f; trendHas[i] = false; }
  lastBucketMs   = now;
  binStartMs     = now;
  lastRateSample = now;
  noiseWinStart  = now;
  noiseSubStart  = now;
  lastDropTimestamp = now;

  currentState = STATE_MAIN;
  currentPage  = PAGE_WAVE;
  needRedraw   = true;
}

void loop() {
  unsigned long now = millis();

  sampleSensorAndDetect(now);       // งานเร่งด่วนที่สุด เรียกทุกรอบเพื่อไม่ให้พลาดหยด
  handleButton();
  handleBuzzerEngine(now);
  updateFlowMath(now);
  updateTrendAccumulator(now);
  updateStatusLed(now);

  if (isHoldUiActive) return;       // ขณะกดค้าง ให้ HUD ครองหน้าจอ

  if (currentState == STATE_ABOUT) {
    if (needRedraw) drawAboutScreen();
    return;
  }

  if (needRedraw) {
    needRedraw = false;
    switch (currentPage) {
      case PAGE_WAVE:   drawWavePageFramework();   drawWavePageDynamic(now);   break;
      case PAGE_TREND:  drawTrendPageFramework();  drawTrendPageDynamic(now);  break;
      default:          drawSensorPageFramework(); drawSensorPageDynamic(now); break;
    }
    lastDynamicMs = now;
    return;
  }

  // ปรับค่าตัวเลข/กราฟตามรอบเวลาของแต่ละหน้า (กราฟรูปคลื่นวาดทีละคอลัมน์ในตัวอ่านเซนเซอร์แล้ว)
  unsigned long interval = (currentPage == PAGE_SENSOR) ? 150UL : 400UL;
  if (now - lastDynamicMs >= interval) {
    lastDynamicMs = now;
    switch (currentPage) {
      case PAGE_WAVE:   drawWavePageDynamic(now);   break;
      case PAGE_TREND:  drawTrendPageDynamic(now);  break;
      default:          drawSensorPageDynamic(now); break;
    }
  }
}
